# Actividad - Trabajando con DataFrames de Pandas.
## Criterios de evaluación.

* Se deben utilizar nombres de variables descriptivos y claros (Utilizar la nomeclatura correspondiente para los nombres de variables).
* Comentarios claros y concisos que expliquen el propósito de cada sección del código.
* Utilizar mensajes de commit **descriptivos**. (Puedes utilizar la extension CONVENTIONAL COMMIT de VS-CODE). 
* Entrega en tiempo y forma.
* Todo el código desarrollado debe ser subido a un repositorio en GitHub (el nombre del repositorio de seguir la siguiente estructura: pandas_df_tlp3_nombre_apellido).
* Para resolver las actividades se debe insertar casillas de codigo entre cada actividad del cuaderno de Jupyter
* Deben trabajar con el datasets adjunto a la actividad

### ¡Importante!
**El incumplimiento de los criterios de evaluación restará puntos en la nota final del práctico!**

In [49]:
import pandas as pd
import sqlite3

#Aqui agrega la conexión a la base de datos
connexion=sqlite3.connect("Salaries.sqlite") 
#Crea el dataframe con los datos del datasets
df=pd.read_sql_query("SELECT * FROM Salaries", connexion)
#Cierra la conexión a la base de datos
connexion.close()

In [50]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

1. **Top 10 empleados con mayor salario total (incluyendo beneficios)**
Extrae e imprime un top 10 de expleados con mayor salario incluyendo los beneficios

In [51]:
#todo
top_10=df[["EmployeeName", "TotalPayBenefits"]].sort_values("TotalPayBenefits", ascending=False).head(10)

print("Los 10 empleados con mayor salario son:")

top_10

Los 10 empleados con mayor salario son:

                EmployeeName  TotalPayBenefits
0             NATHANIEL FORD         567595.43
1               GARY JIMENEZ         538909.28
110531           David Shinn         510732.68
110532            Amy P Hart         479652.21
110533  William J Coaker Jr.         436224.36
72925         Gregory P Suhr         425815.28
72926   Joanne M Hayes-White         422353.40
110534        Gregory P Suhr         418019.22
110535  Joanne M Hayes-White         417435.10
110536       Ellen G Moffatt         415767.94

2. **Filtrar empleados con más de 50,000 en horas extra, la columna a tratar es: (OvertimePay)**

In [52]:
empleados_trabajadores=df[["EmployeeName", "OvertimePay"]]
df["OvertimePay"]=pd.to_numeric(df["OvertimePay"], errors="coerce")
empleados_trabajadores

             EmployeeName   OvertimePay
0          NATHANIEL FORD           0.0
1            GARY JIMENEZ     245131.88
2          ALBERT PARDINI     106088.18
3       CHRISTOPHER CHONG      56120.71
4         PATRICK GARDNER        9737.0
...                   ...           ...
148649      Roy I Tillery          0.00
148650       Not provided  Not Provided
148651       Not provided  Not Provided
148652       Not provided  Not Provided
148653          Joe Lopez          0.00

[148654 rows x 2 columns]

In [59]:
#todo
empleados_trabajadores=df[["EmployeeName", "OvertimePay"]]
mayores_horas=df[df["OvertimePay"]>50000]
print("Los empleados con más de 50,000 de horas extras son:")
mayores_horas.head(5)

Los empleados con más de 50,000 de horas extras son:

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,None,538909.28,538909.28,2011,None,San Francisco,None
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,None,335279.91,335279.91,2011,None,San Francisco,None
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,None,332343.61,332343.61,2011,None,San Francisco,None
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,None,315981.05,315981.05,2011,None,San Francisco,None
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,None,303427.55,303427.55,2011,None,San Francisco,None

3. **Contar cuántos empleados únicos hay por año**

In [54]:
#todo
df.groupby("Year")["EmployeeName"].nunique()

Year
2011    33878
2012    34349
2013    36150
2014    36684
Name: EmployeeName, dtype: int64

4. **Ver cuántos cargos únicos (JobTitle) existen y los 5 más comunes**

In [55]:
#todo
cargos_unicos = df['JobTitle'].value_counts().nunique()
print("El número de cargos únicos es:")
cargos_unicos

El número de cargos únicos es:

294

In [56]:
top_5=df["JobTitle"].value_counts().sort_values( ascending=False).head(5)
print("Los 5 cargos con más empleados son:")

top_5

Los 5 cargos con más empleados son:

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

5. **Mostrar el salario total (TotalPay) promedio por año**

In [57]:
#todo
salario_total=df.groupby("Year")["TotalPayBenefits"].mean()
print("El salario promedio por año es:")
salario_total

El salario promedio por año es:

Year
2011     71744.103871
2012    100553.229232
2013    101440.519714
2014    100250.918884
Name: TotalPayBenefits, dtype: float64

6. **Exporta todos los datos a un CSV y muestra los ultimos 10 valores**

In [58]:
#todo
df.to_csv("Salaries_con_cambios.csv", index=False)